import { FC } from "react";
import styles from "./RulesSection.module.scss";

const RulesSection: FC = () => {
  return (
    <>
      <div id="rules" className="invisible h-0 -mt-[104px]"></div>
      <section className={styles.rules}>
        <h1>Правила гри</h1>
        <div>
          <ul>
            <li>
              Машина не повинна бути недоступною (наприклад, не вимикайте або не
              перезавантажуйте її, не застосовуйте правила брандмауера або
              iptables для припинення зв'язку, не припиняйте всіх служб, не
              допускайте помилок машини тощо).
            </li>
            <li>
              Зупиняйте службу лише у випадку, якщо інші способи виправлення не
              дають результату. Послуги повинні залишатися доступними для
              "справжніх користувачів коробки", якщо це можливо. Зміна портів
              послуг дозволена. Спробуйте зберегти машини в максимально
              можливому первісному стані.
            </li>
            <li>
              Не можна змінювати/видаляти прапорці чи їхні дозволи (якщо
              будь-який прапорець читається всім, його слід залишити таким).
            </li>
            <li>
              Заборонено атакувати, змінювати та зупиняти службу на порті 9999.
            </li>
          </ul>
          <img src="/assets/cats1.png" alt="cats" />
        </div>
        <div>
          <ul>
            <li>Заборонено будь-який вид DoS атак на машину.</li>
            <li>
              Заборонено атакувати інших користувачів (у вас немає причин
              намагатися розпізнати будь-яку IP-адресу, окрім тієї, яку вам
              надано на сторінці гри).
            </li>
            <li>
              Не видаляйте системні двійкові файли (за винятком chattr) і не
              змінюйте дозволи для виконуваних файлів (або їх каталогу).
            </li>
            <li>
              Якщо є одна вразливість, яка може бути виправлена, то не треба
              здійснювати спам. Існує 4-5 методів, за допомогою яких можна
              закріпитися на кожній машині.
            </li>
          </ul>
          <img src="/assets/cat2.png" alt="cat" />
        </div>
      </section>
    </>
  );
};

export default RulesSection;
